{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "intern",
    "1": "junior",
    "2": "lead",
    "3": "low_value",
    "4": "senior",
    "5": "template"
  },
  "initializer_range": 0.02,
  "label2id": {
    "intern": 0,
    "junior": 1,
    "lead": 2,
    "low_value": 3,
    "senior": 4,
    "template": 5
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.9.0",
  "use_cache": false,
  "vocab_size": 30522
}
